## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # helm_release.cluster-issuer will be created
+   resource "helm_release" "cluster-issuer" {
+       atomic                     = false
+       chart                      = "../charts/cluster-issuer"
+       cleanup_on_fail            = false
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "cluster-issuer"
+       namespace                  = "kube-system"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       verify                     = false
+       version                    = "0.1.1"
+       wait                       = true
+       wait_for_jobs              = false

+       set_sensitive {
+           name  = "zerossl-eab-hmac-key"
+           value = (sensitive value)
        }
+       set_sensitive {
+           name  = "zerossl-eab-hmac-key-id"
+           value = (sensitive value)
        }
+       set_sensitive {
+           name  = "zerossl_email"
+           value = (sensitive value)
        }
    }

  # kubernetes_secret.zerossl-eab-hmac-key must be replaced
-/+ resource "kubernetes_secret" "zerossl-eab-hmac-key" {
!       id        = "kube-system/zerossl-eab-hmac-key" -> (known after apply)
-       immutable = false -> null
        # (2 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 0 -> (known after apply)
-           labels           = {} -> null
            name             = "zerossl-eab-hmac-key"
!           namespace        = "kube-system" -> "default" # forces replacement
!           resource_version = "579623" -> (known after apply)
!           uid              = "a1c16ae9-2fd2-4199-9d5d-08ad79f6f2d0" -> (known after apply)
        }
    }

  # kubernetes_secret.zerossl-eab-hmac-key-id must be replaced
-/+ resource "kubernetes_secret" "zerossl-eab-hmac-key-id" {
!       id        = "kube-system/zerossl-eab-hmac-key-id" -> (known after apply)
-       immutable = false -> null
        # (2 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 0 -> (known after apply)
-           labels           = {} -> null
            name             = "zerossl-eab-hmac-key-id"
!           namespace        = "kube-system" -> "default" # forces replacement
!           resource_version = "579622" -> (known after apply)
!           uid              = "961350ed-0c28-41fb-bd6e-98436de72f39" -> (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 2 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
